const n=`---
title: 公司12（线上）
urlname: awf3ubk6gibkuthu
date: 2024-12-02 21:35:04 +0800
tags: []
description: 蓝云软件线上面试如何来封装一个弹窗组件？htmlcss属性，事件，插槽，回调如何判断现在页面滚动到底部了？如何计算页面滚动条的宽度？如何定义树形结构的数组，如何要查询，如何从底部查到上级，再上级来显示；然后页面上你如何去展示去写这个html来展示一棵树给你一个树形结构，你来编写一个函数，过滤出...
image: ''
categories: []
---

蓝云软件

线上面试

如何来封装一个弹窗组件？

html

css

属性，事件，插槽，回调

如何判断现在页面滚动到底部了？

如何计算页面滚动条的宽度？

如何定义树形结构的数组，如何要查询，如何从底部查到上级，再上级来显示；然后页面上你如何去展示去写这个html来展示一棵树

给你一个树形结构，你来编写一个函数，过滤出使用者需要的节点（类似数组的fliter；如何去写）

如何开发一个表格组件

html

css

属性，事件，插槽

比如来可以控制列宽，拖拽，回调，单元格合并

拖拽API和拖拽流程的生命周期

vue-router的原理

hash和history的监听

子路由

如何缓存组件，如何去保存其中的状态（定制化缓存）
`;export{n as default};
