const n=`---
title: 公司11（线下）
urlname: dyi3yrsnemezu50r
date: 2024-12-03 14:28:25 +0800
tags: []
description: 百图科技线下面试一面之前的离职原因是什么？介绍下在公司做什么项目，用什么技术？介绍下后台商务管理系统？大屏是什么样的？介绍业务？大屏设计，编辑器技术栈是什么？前端多少人？前端开发规范？stylelint你们用过吗？js运行机制？（执行上下文）this作用域变量事件循环？js是单线程还是多线程的...
image: ''
categories: []
---

<font style="color:rgb(102, 102, 102);">百图科技</font>

<font style="color:rgb(102, 102, 102);"></font>

<font style="color:rgb(102, 102, 102);">线下面试</font>

<font style="color:rgb(102, 102, 102);"></font>

<font style="color:rgb(102, 102, 102);">一面</font>

之前的离职原因是什么？

介绍下在公司做什么项目，用什么技术？

介绍下后台商务管理系统？

大屏是什么样的？介绍业务？

大屏设计，编辑器

技术栈是什么？

前端多少人？

前端开发规范？

stylelint你们用过吗？

js运行机制？（执行上下文）

this

作用域

变量

事件循环？

js是单线程还是多线程的？

你认为函数是什么东西？

箭头函数

普通函数

构造函数

纯函数

如何理解模块化

用闭包解决了什么问题？

用promise解决了什么问题，解决了什么痛点？promise常用方法？

动态表单（项目难点亮点）

用户权限指令？

拿到他的父元素，然后把他的元素remove掉

图片懒加载

通过视口去改变图片的src属性

大文件分片上传

组件穿透？

vue3与vue2哪个用的多？

了解sse通信吗？

是一种允许服务器向客户端推送信息的通信技术

WebSocket相比，SSE的优势在于其简单易用，不需要额外的库或协议支持。然而，WebSocket支持双向通信，而SSE仅支持服务器向客户端推送数据。

websocket应用？

uni-app有项目吗？

有没有上架？

css3动画用的多吗？主要用过哪些？（查看了官网）

你希望入职什么样的公司（自研的，还是半外包的公司）？

二面

毕业了只在这家公司待了三年？

前端规模？20+前端，如何分工？

强度高吗？

离职原因？

愿意接受这个半自研公司吗？

工作模式：

产品+设计+2个前端+1后端+1测试
`;export{n as default};
