const n=`---
title: 公司3（线下）
urlname: erviqtca4w1g1kok
date: 2024-10-29 09:46:53 +0800
tags: []
description: 西软信息技术给酒店做系统管理的招聘要求展示jsvuewebpacknodenginxhttp面试情况(2024.10.30)说说你之前哪部分工作做的多一点？后台管理系统他说到就是做一些增删改查的操作是吧？这看你怎么理解了，那其实往大了说，写逻辑都是数据处理，做大屏就是调api你期望的工作流程或...
image: ''
categories: []
---

西软信息技术

给酒店做系统管理的

## 招聘要求展示

js

vue

webpack

node

nginx

http

## <font style="color:rgb(51, 51, 51);">面试情况(2024.10.30)</font>

说说你之前哪部分工作做的多一点？

> 后台管理系统
>
> 他说到就是做一些增删改查的操作是吧？
>
> 这看你怎么理解了，那其实往大了说，写逻辑都是数据处理，做大屏就是调api

你期望的工作流程或者工作规范，工作团队是怎么样的？

你觉得15k需要具备哪些技能

> 完成业务开发
>
> 考虑的更好一些，尽量把代码写好一些
>
> 代码本身不值钱吧，思维和方法和解决方案的思路这个可能就很不一样

讲讲你自己拥有什么特别好的技能

> 对网络
>
> 对浏览器的调试
>
> 写代码尽量更多的去思考吧（而不是单纯的完成一个功能，功能边界等等）

说说你做过的性能优先

> 分包
>
> terser
>
> 懒加载
>
> gzip
>
> cdn
>
> teee shaking

vue2升级到vue3，如何做

> 1.有一个gogocode的库，可以升级
>
> 2.有官网可以查看文档
>
> 官方提供了一个@vue/compat的包，他会尽量模拟vue2的写法去写vue3,只需要修改package.json的vue版本和安装这个包，还有vue的编译器等就可以先运行起来看看
>
> 就算升级了，那么里面还是使用option api的写法，真正要发挥vue3的作用，还是得重新整理，只是能保证暂时不报错

跟本地硬件做交互的经验有没有?

> 用nest.js做过比如读取cpu.bios,主板用户电脑主板的信息

文件上传为什么传服务器，而不是oss?

用服务器传会占用带宽。。。。。。如何

> 我们公司员工内部的视频文件还是搭在公司服务器上的，然而像一些模块，官网展示是视频是前端上传的，上传之前需要先请求后端拿到临时的上传信息（账号密码等）

讲讲你写的组件库，请求库

vue和react的区别

函数式组件使用场景和原理
`;export{n as default};
