const n=`---
title: 面试经验
urlname: fkfzg3sgwodug9uk
date: 2024-11-08 10:44:41 +0800
tags: []
description: 大厂 中厂 正规公司 重视原理 项目大厂会在一个角度追问，也会问的很深小厂 外包
  重视api如何使用，以及常见功能怎么去做问你怎么测试，怎么部署都是小公司，小公司的问题深度不深尽量不紧张，不磕巴，回答有条理开放问题回答的特别好，一题就完成了面试的时候不要怯场，不要紧张，不要磕巴，不要和面试官对...
image: ''
categories: []
---

大厂 中厂 正规公司 重视原理 项目

大厂会在一个角度追问，也会问的很深

小厂 外包 重视api如何使用，以及常见功能怎么去做

问你怎么测试，怎么部署都是小公司，小公司的问题深度不深

尽量不紧张，不磕巴，回答有条理

开放问题回答的特别好，一题就完成了

面试的时候不要怯场，不要紧张，不要磕巴，不要和面试官对着干，我们也不是敌人，可能也会有压力测试，可能也会刁难，这就没关系，不要去在乎他，只需要关注自己就行了

面试的时候 不要笑 不要说这样行吗 简单写一个可以吗 这样的话？

千万不能笑 要严肃

面试的时候他问的笼统，你就分点，分细尽量多说。

面试的时候他问的一个细节，那么你就围绕这个细节，尽量多说，也不要扯别的，知道的深度的尽量说

身体坐直 声音洪亮 尽量不要有小动作

面试的时候如果公司用vue，那么vue就是考题重点，如果不是，那么工程化和js基础就是重点

面试一个人，对方也是需要花费成本的，所以一定是他觉得你简历还行，才给你面试机会，他也想你能够入职

面试的本质是一个销售自己的过程，需要让对方了解你，展示自己，竞争环境。尽量的多展示自己的能力，尽量多说，涉及到更多的方案。

面试的时候会卡很多东西，电子科技大学的硕士也找不到工作，所以已读不回正常，未读不回也正常

卡学历（985 211）

卡特殊行业（金融 政府经验）

卡特殊语言（微信小程序 three.js）

卡薪资

可能hr一个小时要看上百封简历，已读不回可能真的不是自己的问题

现在开发就是一个买方市场

一天真的能收到上百封简历

面试分为：

宏观：方案，知识广度，深度

微观：具体如何实现？代码怎么写？
`;export{n as default};
