const n=`---
title: 面试理解
urlname: fryoy6p5mr0g4cir
date: 2025-02-17 21:36:02 +0800
tags: []
description: 面试聊的项目
  不需要你做的，而是你能做的，一切你能做的，都可以是你做的工作年限长了以后，基本没有兴趣问一些很细的八股文，核心概念还是会涉及，更多的是看你有没有拿得出手的项目公共组件现在作为难点亮点不好摆盘（已经烂大街了，可能确实很复杂，但在面试的时候说不出来效果的）代码题和场景题考验真实水平（...
image: ''
categories: []
---

面试聊的项目 不需要你做的，而是你能做的，一切你能做的，都可以是你做的

工作年限长了以后，基本没有兴趣问一些很细的八股文，核心概念还是会涉及，更多的是看你有没有拿得出手的项目

公共组件现在作为难点亮点不好摆盘（已经烂大街了，可能确实很复杂，但在面试的时候说不出来效果的）

代码题和场景题考验真实水平（不好准备）

优化场景可以准备

面试时候手写题的变量命名，代码结构都会需要看的

千万不是只是做出来就以为行了

<font style="color:rgb(37, 41, 51);">封装一个组件，一定要搞清楚所有的边界和约束，理解清楚需求再去做</font>

<font style="color:rgb(37, 41, 51);"></font>

<font style="color:rgb(37, 41, 51);">遇到不会的问题的时候可以说能不能给点提示 共同解决（面试官很愿意你通过思考去解决有一些问题，因为在工作中也是这样）</font>

好好准备项目，最近的项目，一定要好好包装（怎么做，怎么说）

吹牛逼，把自己包装成一个高级工程师

如何确定是不是学历和经历的问题

你就造，写好学校，计算机专业，有大公司经验，你看他们叫不叫你面试，会不会给你发offer

场景题 是面试

面试不是笔试 面试一定要宏观回答，他要的是方案

> 当然，有些面试官还是喜欢问具体实现，可以扎进去说

简历一定要敢写，不然没有面试机会

面试过不了 至少也积累了面试经验

面试回答

层次感 从宏观讲到细节

面试官喜欢看一些东西 博客 文档

面试官喜欢问一个东西有没有上线，上线说明已经完成

算法：面试官觉得你能搞定算法的复杂问题，你也能解决项目中的复杂问题，考算法是最快的方式去验证你的能力，也是经过实践验证的

> 特别是大厂

面试的时候不要透露自己是全栈，重心还是要放在前端

看之前薪资的目的：之前薪资就代表着上一家公司对你能力的客观评价

看学历：筛选人

你说你厉害，那为什么不是本科，为什么不是211.985

看经历：筛选人

你说你厉害，为什么都是小团队，为什么没有开源贡献和自己的作品？

面试永远是一个竞争环境，公司之间也是，人与人之间更是

面试聊天的时候 问你场景 不要聊细，聊一些宏观层面的东西 就显得高端了

视角层面

方案层面

> 问大问题的时候 就聊宏观
>
> 问小问题的时候，就聊具体实现（微观）

空窗期太长就可以说，之前离职了还在帮他们干活，只是没去公司

我还在兼职着帮他们干活 给我发的现金

只要面试能过，后面一切都好说

简历作假 都是后话

费曼学习法 复述

1确实有效果

2.也是提前为面试做准备

> 其实和大家说话也是练表达，对面试有帮助，跟同事和家人说话也是一样，必须要多说，口条才会好

<font style="color:rgb(38, 38, 38);">简历一定不能太薄，比如你有5年经验，那么你的项目，工作量，难点亮点，解决方案和应用场景一定要看出来有这么多年的沉淀才行</font>

<font style="color:rgb(38, 38, 38);"></font>

前端最主要的能力是看项目复杂度，跟业务绑定的不深

<font style="color:rgb(38, 38, 38);">大方向：数据处理 性能优化 交互动画</font>

<font style="color:rgb(38, 38, 38);"></font>

面试的时候 总会问你难点亮点 代码架构 宏观的东西 需要你了解更多高级知识，简单来说他想要找个能力很强的人，可是进来以后却让你打螺丝，写一些重复的业务代码，这个时候他又不需要或者不想要你去了解架构和复杂场景，只希望你螺丝拧快点，交给你的螺丝拧紧一点就好

<font style="color:rgb(38, 38, 38);">每一家公司都是如此，这其实感觉有点割裂</font>
`;export{n as default};
