const n=`---
title: 公司9（线下）
urlname: gkncqh38qg2ugwze
date: 2024-11-19 09:58:58 +0800
tags: []
description: 人本集团介绍：mock,webpack,vue,sass,node.js,linux自我介绍了解微前端吗？（没有了解）http和https有什么区别？代码检查和提交的流程？问项目难点亮点(组件穿透，动态表单)跨域问题客户关系系统难点亮点服务端渲染和客户端渲染的区别？ssr的缺点服务器压力大调试...
image: ''
categories: []
---

人本集团

介绍：mock,webpack,vue,sass,node.js,linux

自我介绍

了解微前端吗？（没有了解）

http和https有什么区别？

代码检查和提交的流程？

问项目难点亮点(组件穿透，动态表单)

跨域问题

客户关系系统难点亮点

服务端渲染和客户端渲染的区别？

ssr的缺点

> 服务器压力大
>
> 调试困难 缓存复杂

测试是怎么做？（没有测试，不了解；单元测试，集成测试）

git重要性

csrf和xss攻击？

渐进式web应用程序(pwa)

react会吗？（不会）

原生小程序会吗？(不会，只会uni-app)

技术难点？（大文件上传）

流程表单

pwa

测试方案

微前端

人本条件

劣势：

工作时间：7:45-16:45

通勤：打车30分钟，地铁一个小时

作息：单休

优势

工资：14k

福利：有食堂，五险一金全额交

不确定因素：

忙碌程度？加班？

体检如何进行？

试用期工资如何算？

辞职理由：

工厂气味与过敏导致迫不得已?

去医院看病治疗？

背调：

两边离职理由一致

工作表现

劳动纠纷都会考虑在内

1.我入职一家非互联网企业 下一家互联网企业会觉得不好嘛？

2.我空窗6个月好？还是3个月好？

3.我入职后，我就可以说我上一家工资是14k,我问下一家面试要14-15也不过分吧？
`;export{n as default};
