const n=`---
title: 开找素材
urlname: go28bqo499g30h3g
date: 2026-01-08 20:51:48 +0800
tags: []
description: 简历里多写专业名词，多写第三方库聊的时候一定要先讲背景，以及为什么会发生这样的问题，再去说怎么解决 难点亮点他发问的时候 你可以追问
  或者 分点回答 注意整体性和方案 而不是具体细节公司内部前端知识库项目前端ai交互经验审计安全的库 用到aiwebsocket antv svg
  canvas解...
image: ''
categories: []
---

简历里多写专业名词，多写第三方库

聊的时候一定要先讲背景，以及为什么会发生这样的问题，再去说怎么解决 难点亮点

他发问的时候 你可以追问 或者 分点回答 注意整体性和方案 而不是具体细节

公司内部前端知识库项目

前端ai交互经验

审计安全的库 用到ai

websocket antv svg canvas

解决np问题

网络ip校验

监控平台

gap可以说创业 跟朋友做项目

直接把gap的经验写进去，说自己接外包都行

对自己写过的代码有深入思考

ci/cd docker jenkins k8s

css动画效果 gasp

低代码项目

如何做测试?

平台名字就找过来，平台由测试人员使用

然后说项目内部会集成jest做单元测试，自己做
`;export{n as default};
