const n=`---
title: svg
urlname: hrbfreb2bi2b422g
date: 2026-01-12 17:49:43 +0800
tags: []
description: 位图： 像素组成的图片（放大失真）由一个一个像素点组成每个像素都有颜色值放大 = 像素被拉大 → 模糊 / 锯齿👉
  本质：像素矩阵矢量图： 数学公式画出来的图形 （放大不失真）用
image: ''
categories: []
---

位图： 像素组成的图片（放大失真）

- 由**一个一个像素点**组成
- 每个像素都有颜色值
- 放大 = 像素被拉大 → **模糊 / 锯齿**

👉 本质：**像素矩阵**

---

矢量图： 数学公式画出来的图形 （放大不失真）

- 用**点、线、曲线、公式**描述
- 不关心分辨率
- 放大缩小 = 重新计算 → **永远清晰**

👉 本质：**数学描述**

---

**svg和canvas的区别**

| **对比点**           | **Canvas**                      | **SVG**                    |
| -------------------- | ------------------------------- | -------------------------- |
| **本质**             | **位图（像素）**                | **矢量图（数学描述）**     |
| **渲染方式**         | **JS 直接画到画布上（一次性）** | **每个图形都是 DOM 节点**  |
| **缩放**             | **会失真**                      | **不失真**                 |
| **是否保留图形结构** | ❌** 不保留**                   | ✅** 保留**                |
| **DOM 操作**         | ❌** 不可直接操作单个图形**     | ✅** 可直接操作**          |
| **事件绑定**         | ❌** 需手动计算**               | ✅** 原生支持**            |
| **性能**             | **适合大量、高频绘制**          | **元素多时性能下降**       |
| **动画**             | **手写 or 库（更底层）**        | **CSS / SMIL / JS**        |
| **对于浏览器**       | **你画完就算了，我只管结果 **   | ** 我要记住你画的每一笔 ** |

**svg与普通dom元素的区别**

svg内部不进行布局（svg标签会进行布局）

SVG 内部变化：

- 不触发 reflow
- 只触发 repaint

dom会比svg更高效

**svg和iconfont**

iconfont图标的底层就是svg,他把这些图标都做成一个字体库去展示
`;export{n as default};
