const n=`---
title: 面试前必看
urlname: nrw38rscpe4fpfp4
date: 2024-11-17 18:01:08 +0800
tags: []
description: 1.抬头挺胸，说话声音大声，自信一些，说话更有调理一些2.尽量多说，尽量多说（拉长面试时间才有机会）3.求职是竞争环境，只有比别人更好，才能拿到offer注意：回答问题不要急，不要向赶火车，慢慢说，一点一点说，有条理如果是远程面试，桌面上可以纸笔写一些关键概念，或者打开电脑语雀现找都可以，小小...
image: ''
categories: []
---

1.抬头挺胸，说话声音大声，自信一些，说话更有调理一些

2.尽量多说，尽量多说（拉长面试时间才有机会）

3.求职是竞争环境，只有比别人更好，才能拿到offer

> 注意：回答问题不要急，不要向赶火车，慢慢说，一点一点说，有条理

如果是远程面试，桌面上可以纸笔写一些关键概念，或者打开电脑语雀现找都可以，小小作弊一下

回答问题的步骤：

动机（为什么需要这个东西）

是什么（解释这个东西，也可以说说api，也可以展开说说与他相关的东西）

补充细节（讲原理，优缺点，讲应用，讲之前用到的例子）

讲项目难点的步骤

必要性

实现方案

难点亮点

效果是怎么样的

难点亮点

请求：请求库（组件库） 大文件上传（后台组件）

组件：动态表单（后台组件） 右键菜单（组件库） 命令式组件（组件库） 组件穿透（组件库） 虚拟滚动（组件库）

动态路由（组合）（后台组件）

指令：权限指令（后台组件） resize指令（后台组件）

纯函数：版本比较，相等判断，网络、硬件信息获取

接入鱼汛 钉钉 支付接口

自己学习的东西

性能优化

vite与webpack原理

事件循环

浏览器的渲染原理

获取元素位置：

1.dom.style.width 对应浏览器渲染第一步

2.getComputedStyle(dom).width 对应样式计算

3.dom.clientWidth 对应布局树

4.dom.getBoundingClientRect() 对应第七步 画

vue核心源码

react的思想
`;export{n as default};
