const n=`---
title: 开发模式
urlname: od9vwplngsqto1ub
date: 2026-05-18 10:45:15 +0800
tags: []
description: 瀑布模式将软件开发过程视为一系列按顺序进行的阶段，如同瀑布流水一样，每个阶段都有明确的输入和输出，前一个阶段完成后才进入下一个阶段。典型的阶段包括需求分析、设计、编码、测试、维护等瀑布模型：先设计好一切
  → 一次性开发 → 最后交付敏捷开发模式敏捷开发是一种以人为核心、迭代、循序渐进的开发方法...
image: ''
categories: []
---

### 瀑布模式

将软件开发过程视为一系列按顺序进行的阶段，如同瀑布流水一样，每个阶段都有明确的输入和输出，前一个阶段完成后才进入下一个阶段。典型的阶段包括需求分析、设计、编码、测试、维护等

瀑布模型：先设计好一切 → 一次性开发 → 最后交付

### 敏捷开发模式

敏捷开发是一种以人为核心、迭代、循序渐进的开发方法。它强调团队与客户的紧密合作，通过一系列短周期的迭代来逐步交付满足用户需求的软件产品。短周期不停迭代

敏捷开发：边做边改 → 每隔一段时间就交付一版 → 持续优化

> 别搞一堆流程和文档，先把东西做出来，能跑最重要，而且随时能改。

Scrum：是一种敏捷开发框架，通过固定节奏的迭代周期将需求拆分并逐步交付。在每个迭代周期中，团队会通过计划会确定目标，通过**每日站会**同步进度，通过**评审会**展示成果，并在**复盘会**中持续优化流程

迭代（Iteration / Sprint）：不是做一个大版本上线，而是每周上线一点点（ 设计一点 ，开发一点，测试一点， 发布一点 ）

用户故事（User Story）： 不用写复杂需求文档，而是用一句话描述需求

任务（Task）：Story（需求）-->拆解--->Task（具体工作）

持续集成/持续部署（CI/CD）：代码提交后自动构建、测试、部署

看板（Kanban Board）：可视化工作流（待办 → 进行中 → 已完成）

敏捷开发的本质就是小步快跑、快速反馈、持续改进。不追求一步到位的完美计划，而是在不断迭代中逼近正确的方向。

### DevOps

DevOps 是一组过程、方法与系统的集合，它旨在打破开发（Development）和运维（Operations）之间的传统壁垒，实现软件的持续集成、持续交付和持续部署。DevOps 将开发、测试、运维等多个环节紧密结合起来，通过自动化工具和流程来提高软件交付的速度和质量。
`;export{n as default};
//# sourceMappingURL=od9vwplngsqto1ub-Bz6Zr3Sg.js.map
