const n=`---
title: 简历话术
urlname: ot67dxti3e1us49c
date: 2024-11-08 10:51:39 +0800
tags: []
description: 阅读过书籍&lt;&gt;,对浏览器，网络http有深入理解，注重代码质量，良好的编程思维从0到1的前端项目搭建，复用组件的提炼以及开发，业务代码的编写负责编写前端通用组件的开发以及修改熟悉uni-app,能进行多端兼容和打包有丰富的处理h5移动端适配和兼容性问题的经验，移动App的开发经...
image: ''
categories: []
---

阅读过书籍<<图解http>>,对浏览器，网络http有深入理解，注重代码质量，良好的编程思维

从0到1的前端项目搭建，复用组件的提炼以及开发，业务代码的编写  
负责编写前端通用组件的开发以及修改

熟悉uni-app,能进行多端兼容和打包  
有丰富的处理h5移动端适配和兼容性问题的经验，移动App的开发经验，能够在不同平台上进行高效开发。

通过实现大文件上传(分片上传、断点续传)功能，解决了网络波动等原因导致的文件上传失败问题，为节省流量实现对图片压缩上传功能。

1.窗口性能优化，采用窗口池模式预设窗口，对electron 桌商应用的窗口管理进行了优化，窗口打开速度提升50%  
2.消息传输优化，放弃原有的 ws库，采用兼容性，稳定性更强的 socket.io框架，以事件驱动数据传输，贯通客户端，后端服务，python 进程，.net 应用进程，chrome插件，有效减少了断连，粘包等问题  
3.主进程 |PC通信重构，利用策略模式抽离不同ipc通道的代码，利用 import.meta.glob 实现动态文件绑定，在新建自口时激活ipc 事件绑定，关闭时及时解绑，极大提高了代码可读性和扩展性，避免内存泄漏  
4.表单json数据格式优化，删除不必要的字段，细分组件，以史加细致的字段描述组件细节，在指令的描述文本中以%xoxx %的形式与不同的组件形成关联，实现指令描述的反显能反显出组件的值，同时能使得组件间的联动变更变得更加友好。  
5.本地多端通信架构调整，从最初的 python端起通信服务为中转，优化调整为以前端起中间件服务为中转，一方面与 electron端，python端，.net基础应用建立全双工通信，另一方面与前端起的 pipe 进程连接，实现.net 捕获程序，chrome 插件的通信流贯通。python 端实现长短连接区别，长连接始终保持，短连接在前端调用部分方法时启用，实现完关闭。  
6.前端代码规范工程化，配置 eslint，stvlelint，prettier并在语雀文档规范代码格式，规范git 代码合并描述格式，使用 husky在提交代码前自动执行 lint 检查和格式化，有效提升开发流程标准化  
7.打包配置优化，分为 vte 打包和 elecron 打包，利用 auto-import 插件，自动全局注入 vue 相关组件，同时配置代码压缩打包可视化分析工具，有效减少了最终打包文件的大小，提升30%加载速度  
8.任务队列和定时任务调度优化，将任务队列和定时任务调度从 python端刺离，在前端主进程使用 node-schedule 和队列数据结构实现，python端只负责流程脚本执行，实现功能解耦。  
9.封装 log4j5 ，实现前端主进程，渲染进程，奔渍日志，中间件端，pipe 端各端日志分级生成，使得报错定位更加准确  
10.大文件分片上传，为适应公司服务器带宽限制，录制的视频文件采用分片上传方案上传，再由后端合成，有效实现大文件上传

工作职责:主要负责巡检任务，故障任务两大核心模块的制作，以及app的一些权限，登陆，部署，webView通信,解決H5端到app端的一些问题等  
技术支持:Vue3,pinia,uniapp,uView,ucharts,axios,mapbox,Sass、Vite、Typescript  
个人要点:  
1.登陆功能制作，编写项目权限以及地图控制逻辑  
2.解決app端的一些问题，以及样式修复，解決echarts手机端渲染问题，提供解決方案;解決mapbox无法在app端渲染，使用webView嵌入H5，确立通讯逻辑，提供解决方案，并且适配H5端和app端。  
3.解决各种任务内部巡检，仪器设备表单，数据全部采取多层嵌套树形结构，通过树形演染dom节点以及变量控制逻辑实现动态的树形编辑表单，并配合权限校验实现多个后台审批流程。  
4.项目框架的升级，配置动态组件按需引入，依赖按需引入，以及封装公共axios和api请求类，配置eslint和提交校验钩子，配置代理等等。  
5.提供白屏监控方案，提供屏幕适配方案

1.负责多平台（PC、APP、H5、小程序）的前端框架设计和开发，确保在各种设备和操作系统上的用户体验和功能实现。  
2. 负责各个 APP 平台的打包、发布和上线流程，包括准备必要的资料和根据不同平台的要求进行内容调整，以确保产品顺利上线  
并符合行业标准。  
3. 针对项目进行性能优化、代码重构、故障排除和问题解决，旨在提升产品的性能和稳定性。  
4. 参与项目启动前的需求讨论、技术选型、开发规范制定等关键环节，以确保项目的顺利进行和高质量交付。  
5. 设计并封装可复用性组件，提高代码的可重用性和开发效率。

1. 负责 PC 、移动端的开发和优化，以及正式开发前的框架选型和框架搭建，确保项目结构的合理性和开发效率。
2. 积极参与产品开发前的需求讨论和创意过程，提供有价值的建议，以满足用户需求和提升产品质量。
3. 根据用户需求与后端人员讨论开发规范，商讨开发流程，协商开发过程中的参数传递方式、数据格式，以及在开发过程中遇到  
   的问题，确保项目顺利进行。
4. 及时修复测试、生产以及后期维护过程中产生的问题，与后端人员紧密配合完成相应项目的迭代，保证项目的稳定性和持续改  
   进。
5. 优化代码以及实现方式，提高页面性能和用户体验，以提供更优质的产品和服务。
6. 根据业务需求进行微信小程序开发，同时使用 uni-app 实现跨平台应用的开发。
7. 负责规划产品页面的视觉风格、交互体验，以提升用户体验和满意度。
8. 参与项目前端模块的设计与实现，以及与第三方项目的接口对接工作。
9. 对原有代码进行重构和二次开发，以优化代码结构和提高运行效率。
10. 在社区模块中，设计并实现了点赞、评论、分享、关注、拉黑、举报等交互功能，丰富了用户的社区体验。
11. 负责开发提现功能，包括用户提现申请、提现记录展示等功能，提升了用户的资金管理体验。
12. 对代码进行优化，封装常用组件，并进行打包优化，以提高首页加载速度，从而提升用户体验。
`;export{n as default};
