const n=`---
title: 技术面试通过后
urlname: oum2e9ngxsxoltmh
date: 2025-02-03 21:43:14 +0800
tags: []
description: 通勤薪资构成出差双休，节假日 五险一金怎么交上下班时间试用期多久年终奖加班费 咱们平时要加班要加班吗 有加班补贴吗
  绩效考核什么社保跟工作履历对不上社保与银行流水？如何处理？公司改名 不交社保 不发银行卡
  有时候拿补贴工资跟所说对不上给的是福利，是现金，没有走账，这好说拒绝理由是这样的 有互联...
image: ''
categories: []
---

通勤

薪资构成

出差

双休，节假日

五险一金怎么交

上下班时间

试用期多久

年终奖

加班费 咱们平时要加班要加班吗 有加班补贴吗 绩效考核什么

社保跟工作履历对不上

社保与银行流水？如何处理？

公司改名 不交社保 不发银行卡 有时候拿补贴

工资跟所说对不上

给的是福利，是现金，没有走账，这好说

拒绝理由

是这样的 有互联网公司给我打电话了，我还想再考虑下 你们各有各的优势 我尽快给你答复 最主要你们是单休 现在我还想再考虑下

综合考虑了一下，还是觉得这个工作不太适合我，谢谢这两天的照顾，实在不好意思了，给您带来不便还请谅解

社保

离职证明

银行流水

背调上一家公司

履历背书 是你找下一份工作的资格
`;export{n as default};
