const n=`---
title: 包进阶知识
urlname: oz5u8nq93bakmrt0
date: 2025-03-11 15:15:03 +0800
tags: []
description: 介绍包是一种组织代码结构的方式，一般来讲，一个包提供了一个功能来解决某一个问题，一般一个包会将相关的所有目录和文件放到一个独立的文件夹中，并且通过一个特殊的文件（package.json）来描述这个包。作用域包和非作用域包作用域包（scoped）必须要以
  @ 符号开头，后面跟上你的作用域名称，...
image: https://cdn.nlark.com/yuque/0/2025/png/22718987/1741679029047-bddc5686-be1c-474c-99a8-a8cb199ab0c8.png
categories: []
---

### 介绍

包是一种组织代码结构的方式，一般来讲，一个包提供了一个功能来解决某一个问题，一般一个包会将相关的所有目录和文件放到一个独立的文件夹中，并且通过一个特殊的文件（package.json）来描述这个包。

### 作用域包和非作用域包

#### 作用域包（scoped）

必须要以 @ 符号开头，后面跟上你的作用域名称，接下来一个斜杠，最后是包名

> @vue/cli、@vue/runtime-core、@vue/shared

作用：

可以避免重名的情况，这个作用域名可以充当一个**命名空间**

通过作用域名往往也能表达**某一系列包是属于某一个组织**

#### 非作用域包（unscoped）

非作用域包由于没有特定的作用域，因此你在发布的时候一定要保证你的包名是全局唯一的

> lodash、axios

### 公有包和私有包

public package：公共包是在 npm 注册表中公开发布的包，任何人都可以搜索、查看和安装这些包。公共包在发布时默认为开源许可证（如 MIT、BSD、Apache 等），这意味着其他人可以自由地查看源代码、修改代码并在自己的项目中使用。当你希望与广泛的开发者社区共享你的代码并允许他们参与到项目中时，可以选择发布为公共包。

private package：私有包是在 npm 注册表中非公开发布的包，它们只能被特定的用户或团队成员搜索、查看和安装。私有包通常用于存储企业内部的代码和资源，或者在开发过程中尚未准备好向公众发布的项目。要发布和使用私有包，你需要拥有一个 npm 付费账户 并将包的 private 属性设置为 true。private package 通常都是 scoped package。

通常根目录下会有LICENSE.txt文件内容可以查看

### 指令

#### 查看指令

npm version：查看当前 npm cli 的详细信息，相比 npm -v 显示的信息要更丰富一些。

npm root：查找本地或者全局安装的包的根目录。查看全局的包目录的话，需要添加 -g

npm info：查看某一个包的详细信息，这里所说的信息是指包版本、依赖项、作者、描述等信息，便于开发者选择合适的包。

npm search：这个命令是对包进行搜索，提供一个关键字，会搜索出所有和关键字相关的包

npm outdated：该命令可以用于检查当前项目中的依赖包是否过时，以及当前可用的最新版本。

npm ls：可以罗列出当前项目安装的依赖包以及依赖包下层的依赖。通过 --depth 0/1/2 来进行层级的调整，例如 npm ls --depth 1就能够罗列出当前依赖以及当前依赖下一层所需的依赖。如果是 npm ls -g 罗列出全局的包

#### 配置指令

npm 的配置可以从三个地方：

- conmand line（命令行）
- 环境变量
- .npmrc 文件

查看

npm config

编辑

npm config edit 进入到编辑模式，里面能够编辑各种配置项目

#### 建立包与包软链接

暂时没感觉用处

#### 缓存指令

npm cache

当我们安装、更新或者卸载包的时候，npm 会将这些包的 tarball 文件缓存到本地磁盘上，有助于加速将来的安装过程。之后再次安装的时候，可以直接从缓存文件中去获取，无需再次从远程仓库下载。

> _tarball_ 文件是一种压缩文件格式，通常用于在 _Unix_ 和 _Linux_ 系统中打包和分发源代码、二进制文件或其他文件。_tarball_ 文件的扩展名通常为 _.tar.gz_ 或 _.tgz_，它们是通过将多个文件打包成一个 _.tar_ 文件（使用 _tar_ 工具），然后将该文件进行 _gzip_ 压缩而创建的。
>
> 在 _npm_ 中，_tarball_ 文件通常用于将包的所有文件（源代码、二进制文件、文档等）打包成一个单独的文件，以便在安装或更新包时从 _npm_ 仓库（如 _registry.npmjs.org_）下载。当你运行 _npm install **<**package>_ 时，_npm_ 会从远程仓库下载包的 _tarball_ 文件，然后在本地解压缩和安装该包。

- 清理缓存：npm cache clean，在较新的版本中，目前已经不推荐直接清理缓存，而是推荐 npm cache verify 去验证缓存。
- 验证缓存：npm cache verify，验证缓存的完整性，检查缓存是否已经过期、无效、损坏，也就是说，验证缓存是否有用，如果没用再进行删除。
- 添加缓存：npm cache add <package> ，一般不需要手动添加缓存，因为在安装包的时候就会自动添加缓存
- 查看缓存：npm cache ls 查看npm缓存的所有的包
- 查看缓存目录：npm config get cache

#### 包更新指令

npm update：该指令用于更新当前项目中的依赖包，npm 会检查是否有新的版本，如果有就会进行更新，但是注意，在更新的时候会去满足 package.json 里面的版本范围规定

> 会更新所有包

更新单一包

npm update package_name

#### 审计

npm audit：用于检查当前项目中的依赖，哪些依赖有漏洞

- 在审计的同时，可以直接进行修复，通过命令 npm audit fix

#### 优化

npm dedupe：该命令能够优化项目里面的依赖树的结构

#### 帮助

npm help：帮助指令，可以查看 npm 中提供的所有指令

###
`;export{n as default};
