const n=`---
title: 搭建私有库
urlname: vnqhpf3eo1fepunm
date: 2025-03-29 21:28:44 +0800
tags: []
description: 介绍在企业应用开发中，很多时候我们要发布的包是私有的。作用：能够保证代码的私密性因为是在局域网内部，因此下载速度更快可以将发布的包做一些权限上设置，利于维护搭建方式npmnpm上面倒是支持发布私有包，但是需要付费账号，因此更好的选择就是搭建私有服务器。Verdaccio原理利用verdacci...
image: ''
categories: []
---

# 介绍

在企业应用开发中，很多时候我们要发布的包是私有的。

作用：

- 能够保证代码的私密性
- 因为是在局域网内部，因此下载速度更快
- 可以将发布的包做一些权限上设置，利于维护

# 搭建方式

## npm

npm上面倒是支持发布私有包，但是需要付费账号，因此更好的选择就是搭建私有服务器。

## Verdaccio

### 原理

利用verdaccio(本身会起一个node服务)，会有一个仓库地址，然后使用者利用nrm切换到仓库地址的镜像，这个镜像可以设置某些账号只能使用，某些账户可以上传包。当然这个私服中自己写的包肯定是少数，如果请求第三方（公开包的时候），verdaccio可以设置上游地址去下载，然后会缓存到私有服务器本地中

### 介绍

- 轻量级：Verdaccio 采用 Node.js 编写，安装和运行起来非常快速。它不依赖于任何外部数据库，而是将数据存储在本地文件系统中。
- 简单的配置：Verdaccio 的配置非常简单，只需一个 YAML 文件即可。您可以轻松地指定用户权限、上游代理、缓存设置等。
- 缓存和代理：Verdaccio 可以作为上游 npm 注册表的代理，从而帮助减轻网络延迟和提高包的安装速度。同时，它还会缓存已经下载的包，以便在没有互联网连接的情况下也能正常工作。
- 访问控制：Verdaccio 支持基于用户和包的访问控制，您可以轻松地管理谁可以访问、发布和安装私有 npm 包。
- 插件支持：Verdaccio 支持插件，您可以扩展其功能，如添加身份验证提供程序、审计日志等。

### 安装与使用

安装

\`\`\`javascript
npm i -g verdaccio
\`\`\`

查看 verdaccio 的基本信息：

\`\`\`bash
verdaccio -h
\`\`\`

要启动服务器只需要输入

\`\`\`bash
verdaccio
\`\`\`

- storage：存储包的路径
- web：网站相关的配置，录入 titile 一类的
- uplinks：上游代理，我现在搭建了私服，但是我通过私服下载某些包的时候，私服可能没有。这个时候就会从上游代理中去下载这些包，然后缓存到私服里面

### 配置

storage：存储包的路径

web：网站相关的配置，录入 titile 一类的

uplinks：上游代理，我现在搭建了私服，但是我通过私服下载某些包的时候，私服可能没有。这个时候就会从上游代理中去下载这些包，然后缓存到私服里面

packages：这个配置项就是对权限的控制

auth：设置用户身份的验证方法，默认采用的是 httpasswd 的方式

# YAML

> YAML 格式：这是配置文件的一种常用格式，基本的语法结构由键值对组成，使用缩进来表示层级关系，键值对使用冒号分隔，键和值之间使用一个空格分隔
`;export{n as default};
