const n=`---
title: 个人优势
urlname: yfenzkl0rfa5rt27
date: 2025-02-03 21:53:13 +0800
tags: []
description: 0-1的脚手架经验深入理解vue
  扎实的语言基础产品思维做过前端工具链语雀地址个人主页地址掘金博客发布需要去做的事情低代码经验vue原理源码明确的职业规划------&gt;长久发展-------&gt;一定要传达给面试官，你是稳定的深入css
  scss postcss 主题方案 tailwind 拥有复...
image: ''
categories: []
---

0-1的脚手架经验

深入理解vue 扎实的语言基础

产品思维

做过前端工具链

语雀地址

个人主页地址

掘金博客发布

需要去做的事情

低代码经验

vue原理源码

明确的职业规划------>长久发展------->一定要传达给面试官，你是稳定的

深入css scss postcss 主题方案 tailwind

拥有复杂项目的搭建 会把复杂页面 复杂功能 模块化 分离界面与数据 拥有把功能拆小的能力

熟悉部署ci/cd linux常见命令

算法100+

写出来的技术栈要加几个小众的库 不要烂大街 eslint等等

一定要写点小众的，跟别人不一样的，别人不会的，不要当路人甲
`;export{n as default};
