const e=`---
title: 设计模式
urlname: yoq2v3hl3kgipki5
date: 2024-12-10 11:27:08 +0800
tags: []
description: 观察者模式与发布订阅的区别概念：观察者模式是一对多的依赖关系，发布订阅是发布者将消息发布到消息通道，订阅者从消息通道中订阅自己感兴趣的消息耦合程度：观察者模式紧密耦合，发布订阅模式通过消息代理解耦结构组成：观察者模式由主题（Subject）和观察者（Observer）组成；发布订阅模式由发布者...
image: ''
categories: []
---

## 观察者模式与发布订阅的区别

概念：观察者模式是一对多的依赖关系，发布订阅是发布者将消息发布到消息通道，订阅者从消息通道中订阅自己感兴趣的消息

耦合程度：观察者模式紧密耦合，发布订阅模式通过消息代理解耦

结构组成：观察者模式由主题（Subject）和观察者（Observer）组成；发布订阅模式由发布者（Publisher）、订阅者（Subscriber）和消息代理（Message Broker）
`;export{e as default};
