const n=`---
title: 思想认知
urlname: zq3vz0bmiqf5oy71
date: 2025-02-03 21:54:52 +0800
tags: []
description: 对前端来说
  概念问题是最重要的问题前端的本质就是通过网络来进行数据发送与数据呈现找bug就像解谜游戏，必须要有足够的信息才可以而且对原理了解越深刻，那么解决问题的速度越快知识的广度决定了解决问题的角度知识的深度决定了解决问题的程度组件怎么设计：1.尽量复用（提升开发效率）2.考虑属性，方法，插...
image: ''
categories: []
---

对前端来说 概念问题是最重要的问题

前端的本质就是通过网络来进行数据发送与数据呈现

找bug就像解谜游戏，必须要有足够的信息才可以

而且对原理了解越深刻，那么解决问题的速度越快

知识的广度决定了解决问题的角度

知识的深度决定了解决问题的程度

组件怎么设计：

1.尽量复用（提升开发效率）

2.考虑属性，方法，插槽，ref

3.考虑边界，考虑使用

理解了的东西是很难忘得掉的，所以还是要尽量去理解

薪资高聊项目，解决方案，场景，架构

薪资低聊八股文，难点亮点

公司对你的要求是前置的，你得先会开发，才能成为前端开发

你得先会架构，才能成为架构师

现在是信息爆炸的年代，知识在网上都是公开的，但是每个人对知识的理解是不一样的，就像电影的影评人一样，所以看课看的不是知识本身，而是对知识的理解

读书分为文科生，理科生，其实上了大学就是读书人了，那么做的工作应该就是脑力工作，就是写字楼里面的工作。所以有一句话叫做脱不下孔乙己的长衫

要做一件困难的事情或者思考一个复杂问题的时候，一定要学会拆开，把任务分解成一个个小块，逐一去解决。

同理，一个词不理解的时候，同样可以拆词一点点去理解他

衣服会过时

电脑手机会跟不上配置，会被淘汰，电池会不行

药品，食品，化妆品有保质期

时间与时代是日新月异的变化 消费也是如此 你没法一直不消费

很多时候事情过去了，就没什么大不了 ，可是当时觉得天大的事情，后面想想也啥也不是，千万不要焦虑影响自己的心情

其实20岁的人，还都比较天真浪漫，喜欢幻想

比如考研，总觉得跟着老师学，听老师的话，把题目都做了就会有一个好结果，但其实老师的很多题目都是偏难的，或者跟考题不主流的，你必须要有分辨的能力，还有一些基本概念，最重要的原理一定要彻底理解才行

然后会买一大堆的资料，其实你根本暂时还用不到，但是你还是会买，你觉得买来踏实，就怕漏掉什么知识点，其实就算漏掉知识点也没事，学习也不可能面面俱到，问题是一些核心概念的理解一定要没问题，不能一知半解；比如买了一堆考研和前端的书，还有心理学，还有面膜，但其实很多都已经浪费了，一个人真的没有那么多时间，要做的时候去用，否则真的没必要去囤一些东西

然后会幻想霸道总裁爱上我的剧情，真的，知道自己很普通，但就是会觉得很厉害的人会喜欢我，就不是现实主义，可能这个时候的人也不知道什么是真正的现实，换句话说就是好骗

然后20岁的人会觉得这个世界运行的太慢了，觉得游戏是公平的，觉得游戏好玩，但是自己穷，会觉得自己跑步也快，反应也快，精力也好，也可以熬夜，胡吃海塞，不注重身体，或者感觉不到自己的身体不好；确实，这时候没必要跟他们去讲什么道理。

然后这个时候的人会很看颜值，无论男女，可能这就是动物本能的吸引吧

其实20岁的人还是比较好骗的，没有经过复杂的现实，可以说是在象牙塔中生活，并且受到的教育也不会告诉你这些。一定要抓住某些点去想
`;export{n as default};
